юв_гит_/src/Catalogs/Спецификации/Спецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Спецификации</name>
  <owners>Catalog.Номенклатура</owners>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзм</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Спецификации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Операции</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.ТехнологическиеОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

юв_гит_/src/Catalogs/Спецификации/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура СоставНоменклатураПриИзменении(Элемент)
	СтрокаТчСостав = Элементы.Состав.ТекущиеДанные;
	СтрокаТЧСостав.Тип = ПолучитьТипНаСервере(СтрокаТЧСостав.Номенклатура);
	СтрокаТЧСостав.ЕдИзм = ПолучитьЕдИзмНаСервере(СтрокаТЧСостав.Номенклатура);
	СтрокаТЧСостав.Спецификация = ПолучитьСпецНаСервере(СтрокаТЧСостав.Номенклатура);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипНаСервере(Номенклатура)
	Возврат Номенклатура.ТипНоменклатуры;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЕдИзмНаСервере(Номенклатура)
	Возврат Номенклатура.ЕдИзм;	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСпецНаСервере(Номенклатура)
	СпрСпец = Справочники.Спецификации.Выбрать(Номенклатура);
	СпрСпец.Следующий();
	Возврат СпрСпец.Ссылка;
КонецФункции

#КонецОбласти
